data/perf/sweep-amd-f3deebfbab60/memcached-t24/memcached/tsan-stmt/run1/memtier.txt
10        Threads
50        Connections per thread
100000    Requests per client


BEST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       116607.02          ---          ---         6.39694         6.20700        14.59100        18.68700      7958.39 
Gets      1166057.41       495.52   1165561.89         6.34561         6.14300        14.46300        18.55900     29508.89 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1282664.43       495.52   1165561.89         6.35027         6.17500        14.46300        18.55900     37467.28 


WORST RUN RESULTS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       106047.16          ---          ---         6.97353         7.13500        14.91100        19.07100      7237.69 
Gets      1060459.90       851.55   1059608.35         6.91279         7.07100        14.84700        18.94300     26860.81 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1166507.05       851.55   1059608.35         6.91831         7.07100        14.84700        18.94300     34098.49 


AGGREGATED AVERAGE RESULTS (5 runs)
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       109575.56          ---          ---         6.82094         6.87900        15.10300        19.07100      7478.50 
Gets      1095743.57       791.72   1094951.85         6.76259         6.81500        14.97500        18.94300     27749.19 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1205319.13       791.72   1094951.85         6.76789         6.81500        14.97500        19.07100     35227.69